Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
da-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
                # (34 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2969257613260168772" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587724337308800" -> "1750238470639273800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7477246667493513483" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587723074528000" -> "1750238470380686000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-1"
        name        = "sbeacon-backend-submitDataset-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:127214202110:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20250524134912137300000004/*",
                          - "arn:aws:s3:::gasi-metadata-20250524134912137300000004",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-2"
        name        = "sbeacon-backend-submitDataset-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[3] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-3"
        name        = "sbeacon-backend-submitDataset-3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:4f62482ec585fd4af35af0046156b06e5fcc17e0bf9cc82cfa387c4c0e05b67d" -> (known after apply)
      ~ last_modified                  = "2025-05-30T06:52:50.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
                # (51 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-updateFiles:sbeacon-backend-updateFiles"
        name        = "sbeacon-backend-updateFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-vcfs"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2833714273364533309" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587724566538000" -> "1750238471049368000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6" -> (known after apply)
      ~ code_sha256                 = "h+wbJq3udkSh+6kVzo1MWKJog78SWjKS94t8KZ8ewxA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-30T06:52:14.577+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23530095 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250524134911333700000002/builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "3807902ca0a4a2cab52f9811f9beebfe-5" -> (known after apply)
      ~ id                            = "builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> (known after apply)
      ~ key                           = "builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "834250582485828482" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bb28d3abc81b776d021e811baed0a42a4cb6d37f4950fb379d69b638b5bec4bd.zip" -> "builds/a8fd2fbc510489453391199e26798d7d3530730254d83ef3f1041e20fcf605a4.zip"
          ~ "timestamp" = "1748587741253599000" -> "1750238488077887000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2" -> (known after apply)
      ~ code_sha256                 = "FAgSiE0U+XheIziY6btPgOV1U/g4umbCYfSWNCUds0s=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-24T13:49:54.275+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 38141 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250524134911333700000002/builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "72ae418e1f45ff5be0627579ee664c98" -> (known after apply)
      ~ id                            = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> (known after apply)
      ~ key                           = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1584150168878321239" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip" -> "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip"
          ~ "timestamp" = "1748587724238133000" -> "1750238469957167000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5640390005168123083" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587722920153000" -> "1750238471242565000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "7b60cd68a2b77c5fd1f30be3c297454f0e7761f3"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "d8c5edcb0bb173a1bd0cc4562173a41c3c295551" -> "7b60cd68a2b77c5fd1f30be3c297454f0e7761f3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "41be6c74a5b805014714f235d4e49ad9207437f6"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:5fbf7036631d78dfaef8bbab23bff1d0f1cd153b50269678143542533a34f1c4" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:5fbf7036631d78dfaef8bbab23bff1d0f1cd153b50269678143542533a34f1c4" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "f615adf0fc3395490e8870df7f6f0b9d403acc72" -> "41be6c74a5b805014714f235d4e49ad9207437f6"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2992906384353080974" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587724231167000" -> "1750238485385763000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concat/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/4504ce7714923fa889537746d5f07facc8a41b31c7187654b4e20fc9ec04fdd7.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/concat'"
          + "filename_new"   = "builds/4504ce7714923fa889537746d5f07facc8a41b31c7187654b4e20fc9ec04fdd7.zip"
          + "filename_old"   = "builds/4504ce7714923fa889537746d5f07facc8a41b31c7187654b4e20fc9ec04fdd7.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concat"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-concat.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-concat"
        name             = "svep-backend-concat"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages",
                        ]
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concat/builds/21c6d203451c27ca52fb7052f23d336f201030312cca362109e3a36d9364d289.zip" -> (known after apply)
        id                             = "svep-backend-concat"
      ~ last_modified                  = "2025-05-26T05:47:44.791+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "CREATEPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7837989218290399951" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/21c6d203451c27ca52fb7052f23d336f201030312cca362109e3a36d9364d289.zip" -> "builds/4504ce7714923fa889537746d5f07facc8a41b31c7187654b4e20fc9ec04fdd7.zip"
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-concatPages"
        name             = "svep-backend-concatPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "RESULT_SUFFIX"                 = "_results.tsv"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "SVEP_RESULTS"                  = "gasi-dataportal-20250524134911180600000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-concatStarter"
        name             = "svep-backend-concatStarter"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat",
                        ]
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-temp-20250524134904624400000001",
                          - "arn:aws:s3:::svep-backend-regions-20250524134906107200000005",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*",
                          - "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*",
                        ]
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "CONCAT_SNS_TOPIC_ARN"          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-createPages"
        name             = "svep-backend-createPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*",
                          - "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/clinical-workflows/*",
                        ]
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "SVEP_RESULTS"                  = "gasi-dataportal-20250524134911180600000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-deleteClinicalWorkflow"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-deleteClinicalWorkflow"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-deleteClinicalWorkflow-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-deleteClinicalWorkflow"
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-deleteClinicalWorkflow-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-deleteClinicalWorkflow"
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Delete pending after 2 days clinical workflow using cron job."
      + filename                       = "builds/1dece253ba077d3f5258eb88b81100665daeaf0fca613ac0442d4849188367a0.zip"
      + function_name                  = "svep-backend-deleteClinicalWorkflow"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/deleteClinicalWorkflow",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1dece253ba077d3f5258eb88b81100665daeaf0fca613ac0442d4849188367a0.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1dece253ba077d3f5258eb88b81100665daeaf0fca613ac0442d4849188367a0.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/1dece253ba077d3f5258eb88b81100665daeaf0fca613ac0442d4849188367a0.zip"
          + "timestamp" = "1750238485201174000"
        }
    }

  # module.svep[0].module.lambda-formatOutput.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-formatOutput/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/formatOutput'"
          + "filename_new"   = "builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip"
          + "filename_old"   = "builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-formatOutput"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-formatOutput"
        name             = "svep-backend-formatOutput"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-formatOutput/builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip" -> (known after apply)
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-05-26T05:05:19.685+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "COLUMNS"                       = "rank,region,alt,consequence,varName,geneName,geneId,feature,transcriptId,transcriptBiotype,exonNumber,aminoAcids,codons,strand,transcriptSupportLevel,ref,gt,qual,filter,variationId,rsId,omimId,classification,conditions,clinSig,reviewStatus,lastEvaluated,accession,pubmed,afAfr,afEas,afFin,afNfe,afSas,afAmr,af,ac,an,siftMax"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7058695247862261964" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip" -> "builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/ea8185c0c094404623792dc05581e27c5254ca0cb20595080b9a17505d8a8b8c.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/ea8185c0c094404623792dc05581e27c5254ca0cb20595080b9a17505d8a8b8c.zip"
          + "filename_old"   = "builds/ea8185c0c094404623792dc05581e27c5254ca0cb20595080b9a17505d8a8b8c.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-initQuery"
        name             = "svep-backend-initQuery"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-initQuery/builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip" -> (known after apply)
        id                             = "svep-backend-initQuery"
      ~ last_modified                  = "2025-05-30T06:52:07.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "CONCAT_STARTER_SNS_TOPIC_ARN"  = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PROJECT_USERS_TABLE"    = "sbeacon-dataportal-project-users"
              - "HTS_S3_HOST"                   = "s3.ap-southeast-3.amazonaws.com"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF"
              - "RESULT_DURATION"               = "86400"
              - "R
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.